; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	Star7 - direction
	Star9 - direction
	Star10 - direction
	Star6 - direction
	GroundStation4 - direction
	Star13 - direction
	Star8 - direction
	Star11 - direction
	GroundStation14 - direction
	GroundStation12 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star8)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 Star11)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite0 GroundStation5)
	(pointing satellite1 Star6)
	(have_image Planet15 thermograph2)
	(have_image Planet16 spectrograph0)
	(have_image Phenomenon17 spectrograph0)
	(have_image Star18 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation4 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet15 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet15)
   goals met: 0 of 6
5. (take_image satellite0 planet15 instrument0 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon17 instrument0 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 2 of 6
8. (turn_to satellite0 planet16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet16)
   goals met: 2 of 6
9. (take_image satellite0 planet16 instrument0 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 3 of 6
10. (turn_to satellite0 star18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star18)
   goals met: 3 of 6
11. (take_image satellite0 star18 instrument0 spectrograph0)
   added: (have_image star18 spectrograph0)
   goals met: 4 of 6
12. (turn_to satellite0 groundstation5 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 groundstation5)
   goals met: 5 of 6
13. (turn_to satellite1 star6 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star6)
   goals met: 6 of 6
